package dict

import "strings"

var (
	Conv = map[rune]rune{
		'a': 'a',
		'b': 'b',
		'c': 'c',
		'd': 'd',
		'e': 'e',
		'f': 'f',
		'g': 'g',
		'h': 'h',
		'i': 'i',
		'j': 'j',
		'k': 'k',
		'l': 'l',
		'm': 'm',
		'n': 'n',
		'o': 'o',
		'p': 'p',
		'q': 'q',
		'r': 'r',
		's': 's',
		't': 't',
		'u': 'u',
		'v': 'v',
		'w': 'w',
		'x': 'x',
		'y': 'y',
		'z': 'z',
		'á': 'a',
		'č': 'c',
		'ď': 'd',
		'é': 'e',
		'ě': 'e',
		'í': 'i',
		'ň': 'n',
		'ó': 'o',
		'ř': 'r',
		'š': 's',
		'ť': 't',
		'ú': 'u',
		'ů': 'u',
		'ý': 'y',
		'ž': 'z',
	}
	ConvIndex = [41]int{
		0,  // 'a'
		1,  // 'b'
		2,  // 'c'
		3,  // 'd'
		4,  // 'e'
		5,  // 'f'
		6,  // 'g'
		7,  // 'h'
		8,  // 'i'
		9,  // 'j'
		10, // 'k'
		11, // 'l'
		12, // 'm'
		13, // 'n'
		14, // 'o'
		15, // 'p'
		16, // 'q'
		17, // 'r'
		18, // 's'
		19, // 't'
		20, // 'u'
		21, // 'v'
		22, // 'w'
		23, // 'x'
		24, // 'y'
		25, // 'z'
		0,  // 'á'
		2,  // 'č'
		3,  // 'ď'
		4,  // 'é'
		4,  // 'ě'
		8,  // 'í'
		13, // 'ň'
		14, // 'ó'
		17, // 'ř'
		18, // 'š'
		19, // 'ť'
		20, // 'ú'
		20, // 'ů'
		24, // 'ý'
		25, // 'ž'
	}
)

func StripDiacritic(w string) string {
	var b strings.Builder
	for _, r := range w {
		b.WriteRune(Conv[r])
	}
	return b.String()
}
